In [1]:
# importing pandas module
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 

# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=['a', 'b', 'c', 'd'])
df

     Name  Age    Address Qualification  Mobile No
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [2]:
df.reindex(['b', 'c', 'd', 'a'])

     Name  Age    Address Qualification  Mobile No
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76
a     Jai   27     Nagpur           Msc         97

In [3]:
for i in df.iterrows():
    print(i)

('a', Name                Jai
Age                  27
Address          Nagpur
Qualification       Msc
Mobile No            97
Name: a, dtype: object)
('b', Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Mobile No            91
Name: b, dtype: object)
('c', Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Mobile No               58
Name: c, dtype: object)
('d', Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object)

In [12]:
for i, j in df.iterrows():
    # print(j)
    print(j['Name'])
    print(j['Age'])
    print(j['Address'])
    print(j['Qualification'])
    print(j['Mobile No'])

Jai
27
Nagpur
Msc
97
Princi
24
Kanpur
MA
91
Gaurav
22
Allahabad
MCA
58
Anuj
32
Kannuaj
Phd
76

In [9]:
allData= []
for i, j in df.iterrows():
    # print(j['Name'])
    oneData = {
        'Name': j['Name'],
        'Age' : j['Age'],
        'Address' : j['Address'],
        'Qualification' : j['Qualification'],
        'Mobile No' : j['Mobile No'],
    }
    allData.append(oneData)

print(allData)

Jai
Princi
Gaurav
Anuj
[{'Name': 'Jai', 'Age': 27, 'Address': 'Nagpur', 'Qualification': 'Msc', 'Mobile No': 97}, {'Name': 'Princi', 'Age': 24, 'Address': 'Kanpur', 'Qualification': 'MA', 'Mobile No': 91}, {'Name': 'Gaurav', 'Age': 22, 'Address': 'Allahabad', 'Qualification': 'MCA', 'Mobile No': 58}, {'Name': 'Anuj', 'Age': 32, 'Address': 'Kannuaj', 'Qualification': 'Phd', 'Mobile No': 76}]

In [14]:
for i, j in df.items():
    print(i, j)

Name a       Jai
b    Princi
c    Gaurav
d      Anuj
Name: Name, dtype: object
Age a    27
b    24
c    22
d    32
Name: Age, dtype: int64
Address a       Nagpur
b       Kanpur
c    Allahabad
d      Kannuaj
Name: Address, dtype: object
Qualification a    Msc
b     MA
c    MCA
d    Phd
Name: Qualification, dtype: object
Mobile No a    97
b    91
c    58
d    76
Name: Mobile No, dtype: int64

In [15]:
list(df['Name'])

['Jai', 'Princi', 'Gaurav', 'Anuj']

In [18]:
print(df['Age'].sum())

105

In [16]:
for i in [1, 2, 3, 4]:
  i.sum()

AttributeError: 'int' object has no attribute 'sum'

In [22]:
l =[1, 2, 3, 4]
print(sum(l))
sum([1, 2, 3, 4])

10

10

In [26]:
def test(x):
    return x.sum()
df.apply(test)

Name                      JaiPrinciGauravAnuj
Age                                       105
Address          NagpurKanpurAllahabadKannuaj
Qualification                     MscMAMCAPhd
Mobile No                                 322
dtype: object

In [27]:
df.apply(lambda x: x.sum())

Name                      JaiPrinciGauravAnuj
Age                                       105
Address          NagpurKanpurAllahabadKannuaj
Qualification                     MscMAMCAPhd
Mobile No                                 322
dtype: object

In [30]:
def test(x):
    return str(x).join
df.apply(test, axis=1)

a    <built-in method join of str object at 0x110cb...
b    <built-in method join of str object at 0x110cb...
c    <built-in method join of str object at 0x110ce...
d    <built-in method join of str object at 0x110ce...
dtype: object

In [31]:
df.columns

Index(['Name', 'Age', 'Address', 'Qualification', 'Mobile No'], dtype='object')

In [34]:
df1 = df[['Age', 'Mobile No']]
df1

   Age  Mobile No
a   27         97
b   24         91
c   22         58
d   32         76

In [35]:
df1.applymap(lambda x: x**2)

    Age  Mobile No
a   729       9409
b   576       8281
c   484       3364
d  1024       5776

In [37]:
df.sort_values('Name')

     Name  Age    Address Qualification  Mobile No
d    Anuj   32    Kannuaj           Phd         76
c  Gaurav   22  Allahabad           MCA         58
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91

In [39]:
df.sort_index(ascending=False)

     Name  Age    Address Qualification  Mobile No
d    Anuj   32    Kannuaj           Phd         76
c  Gaurav   22  Allahabad           MCA         58
b  Princi   24     Kanpur            MA         91
a     Jai   27     Nagpur           Msc         97

In [44]:
pd.set_option("display.max_colwidth", 1000)
dfLorem = pd.DataFrame({"test":["Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged.", "Hi I am learning DS", "I will eventually learn AI, ML, DL"]})
dfLorem

                                                                                                                                                                                                                                                                                                                                                                             test
0  Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged.
1                                                                                                                                                                                                                                                                                                                                                             Hi I am learning DS
2                                                                                                                                                                                                                                                                                                                                              I will eventually learn AI, ML, DL

In [45]:
dfLorem['word_ln'] = dfLorem['test'].apply(lambda x: len(x.split()))
dfLorem

,test,word_ln
0,"Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged.",60
1,Hi I am learning DS,5
2,"I will eventually learn AI, ML, DL",7